const baseMusicUrl = 'https://sunxuecong.github.io/github-actions-demo/'

const traillet = {
  id: 1974444808,
  name: "小行迹",
  img: "https://p1.music.126.net/9bVOooAY6U6EJLzpv1Fikw==/109951169682871673.jpg",
  artists: [{ id: 6731, name: "赵雷", tns: [], alias: [] }],
  duration: 277493,
  albumName: "署前街少年",
  url: "https://music.163.com/song/media/outer/url?id=1974444808.mp3",
  artistsText: "赵雷",
  durationSecond: 277.493,
  mvId: 0,
  lyric:"[00:00.00] 作词 : 赵雷\n[00:01.00] 作曲 : 赵雷\n[00:02.00] 制作人 : 赵雷\n[00:42.81]你想预定哪一国的早餐\n[00:48.03]等一杯不加糖的咖啡取暖\n[00:53.40]坐在阳台望着对面的山\n[00:58.56]山尖的雪总是一尘不染\n[01:03.38]\n[01:03.96]去向同样地方的人很多\n[01:09.39]而走在角落的人却只有我\n[01:14.67]我只想静静离开独自徘徊\n[01:19.98]在这陌生却最自由的时刻\n[01:24.51]\n[01:25.38]一场雨揉进乡间的朦胧\n[01:30.63]在湖边回忆往昔的每分钟\n[01:36.00]你是否在仰望潮湿的星\n[01:41.31]还是陷入了闹市的霓虹中\n[01:46.33]\n[01:46.77]吃遍了所有小饭馆\n[01:50.01]海市的便利店\n[01:52.65]走失在迷宫一样的地铁站\n[01:57.21]行李箱与我跌撞地转\n[02:00.57]寻找下家旅店\n[02:03.27]走酸的双脚无处停站\n[02:07.23]\n[02:29.34]去向同样地方的人很多\n[02:34.77]而走在角落的人却只有我\n[02:40.02]我只想静静离开独自徘徊\n[02:45.24]在这陌生却最自由的时刻\n[02:50.11]\n[02:50.67]一场雨揉进乡间的朦胧\n[02:55.95]在湖边回忆往昔的每分钟\n[03:01.38]你是否在仰望潮湿的星\n[03:06.63]还是陷入了闹市的霓虹中\n[03:11.71]\n[03:12.39]吃遍了所有小饭馆\n[03:15.33]海市的便利店\n[03:18.03]走失在迷宫一样的地铁站\n[03:22.53]行李箱与我跌撞地转\n[03:25.92]寻找下家旅店\n[03:28.68]走酸的双脚无处停站\n[03:33.10]\n[03:33.39]跟着冬青树一路向南\n[03:36.60]再见了富士山\n[03:39.27]行迹在地图上画下曲线\n[03:44.04]数着飞机飞回的日子\n[03:47.31]回到旧的城市\n[03:49.98]你的旅行还剩下多少天\n[03:54.49]\n[04:15.99]翻看着照片里的笑脸\n[04:19.44]丢掉手中的烟\n[04:22.23]你的心情有没有好一点\n[04:30.56]\n[04:32.25]\n[04:33.25] 编曲：赵雷\n[04:33.55] 木吉他：赵雷\n[04:33.85] 电吉他：刘磊\n[04:34.15] 贝斯：Damien Banzigou\n[04:34.46] 打击乐：刘恒\n[04:34.76] 班卓琴：刘磊\n[04:35.06] 口风琴：祝子\n[04:35.37] 和声：旭东\n[04:35.67] 录音师：李越\n[04:35.97] 混音师：时俊峰\n[04:36.28] 录音室：野火春风\n[04:36.58] 母带工程室：Sterling Sound\n[04:36.88] 母带工程师：Randy Merrill\n[04:37.18] 封面设计：韩东、小强、阿穆隆\n",
}
const guest = {
  id: 1974444808,
  name: "嘉宾",
  img: "https://p2.music.126.net/6m3m-AavekpkH48tGfh2Kw==/109951165608791795.jpg?param=250y250",
  artists: [{ id: 67311, name: "张远", tns: [], alias: [] }],
  duration: 332560,
  albumName: "嘉宾",
  url:baseMusicUrl + 'jiabin.mp3',
  artistsText: "张远",
  durationSecond:332.560,
  mvId: 0,
  lyric: "[00:00.000] 作词 : 王泽言/张远\n[00:01.000] 作曲 : 王泽言\n[00:02.000] 编曲 : 陈禹骁/任斌\n[00:03.000] 制作人 : 丁培峰\n[00:04.09](未经许可，不得翻唱或使用)\n[00:21.51]分手后第几个冬季\n[00:25.68]今天是星期几\n[00:28.75]偶尔会想起你\n[00:34.34]你突如其来的简讯\n[00:38.38]让我措手不及\n[00:41.73]愣住站在原地\n[00:47.07]当所有人都替你开心\n[00:50.21]我却才傻傻清醒\n[00:52.79]原来早已有人\n[00:55.01]为你订做了嫁衣\n[00:58.14]感谢你特别邀请\n[01:01.28]来见证你的爱情\n[01:04.42]我时刻提醒自己别逃避\n[01:10.43]拿着喜帖一步一步走近\n[01:14.12]他精心布置的场地\n[01:17.71]可惜这是属于你的风景\n[01:21.30]而我只是嘉宾\n[01:23.83]我放下所有回忆\n[01:26.86]来成全你的爱情\n[01:30.10]却始终不愿相信这是命\n[01:35.92]好久不见的你有点疏离\n[01:39.72]握手寒暄如此客气\n[01:43.31]何必要在他的面前刻意\n[01:46.95]隐瞒我的世界有过你\n[02:15.06]不知不觉钟声响起\n[02:19.14]你守候在原地\n[02:22.23]等待着他靠近\n[02:27.81]温柔的他单膝跪地\n[02:31.56]钻戒缓缓戴进\n[02:35.05]你的无名指里\n[02:40.71]当所有人都替你开心\n[02:43.79]我却才傻傻清醒\n[02:46.12]原来我们之间\n[02:48.64]已没有任何关系\n[02:51.68]感谢你特别邀请\n[02:54.81]来见证你的爱情\n[02:58.01]我时刻提醒自己别逃避\n[03:04.07]今天你妆扮得格外美丽\n[03:07.66]这美也曾拥在怀里\n[03:11.41]可惜这是你和他的婚礼\n[03:14.99]而我只是嘉宾\n[03:17.37]我放下所有回忆\n[03:20.45]来成全你的爱情\n[03:23.59]却始终不愿相信这是命\n[03:29.70]说好的永远变成了曾经\n[03:33.30]我试着衷心祝福你\n[03:36.94]请原谅我不体面没出息\n[03:40.52]选择失陪一下先离席\n[03:47.90]又不是偶像剧\n[03:50.79]怎么我演得那么入戏\n[03:55.70]这不堪入目的剧情\n[04:02.22]感谢你特别邀请\n[04:05.21]观赏你要的爱情\n[04:08.45]嘉宾也许是另一种宿命\n[04:14.47]离开你的自己事到如今\n[04:18.06]还有什么资格关心\n[04:21.71]毕竟终成眷属的人是你\n[04:25.40]而我只是嘉宾\n[04:27.77]我流尽所有回忆\n[04:30.86]来庆祝你的婚礼\n[04:34.04]却始终没有勇气祝福你\n[04:40.06]谢谢你送给我最后清醒\n[04:43.64]把自己还给我自己\n[04:50.66]至少我还能够成为那个\n[04:54.25]见证你们爱情的嘉宾\n[05:00.92]遇见你的他真的好幸运\n[05:04.76]但愿他会比我更爱你\n[05:29.06]监制 : 徐怀超\n[05:29.73]和声 : 金天\n[05:30.39]混音 : 张锦亮\n[05:31.05]母带 : 丁培峰\n[05:31.20]录音室 & 录音师 : TRENDY MUSIC@袁栋\n[05:31.55]制作公司 : TRENDY MUSIC\n[05:32.56]SP : 漫吞吞文化\n",
}

const sky = {
  id: 1357374736,
  name: "海阔天空",
  img: "https://p1.music.126.net/qnQ93WnZHACVvIM14c4sAQ==/109951163984007061.jpg",
  artists: [{ id: 11127, name: "Beyond", tns: [], alias: [] }],
  duration: 239560,
  albumName: "海阔天空",
  url: baseMusicUrl + 'haikuotiankong.mp3',
  artistsText: "Beyond",
  durationSecond:239.560,
  mvId: 0,
  lyric: "[00:00.000] 作词 : 黄家驹\n[00:01.000] 作曲 : 黄家驹\n[00:02.000] 编曲 : Beyond/梁邦彦\n[00:19.284] 今天我 寒夜里看雪飘过\n[00:25.843] 怀着冷却了的心窝漂远方\n[00:31.756] 风雨里追赶 雾里分不清影踪\n[00:37.953] 天空海阔你与我\n[00:41.014] 可会变 (谁没在变)\n[00:44.166] 多少次 迎着冷眼与嘲笑\n[00:50.788] 从没有放弃过心中的理想\n[00:56.659] 一刹那恍惚 若有所失的感觉\n[01:02.875] 不知不觉已变淡\n[01:05.950] 心里爱 (谁明白我)\n[01:09.534] 原谅我这一生不羁放纵爱自由\n[01:16.536] 也会怕有一天会跌倒\n[01:22.747] 背弃了理想 谁人都可以\n[01:28.978] 哪会怕有一天只你共我\n[01:35.178]\n[01:43.460] 今天我 寒夜里看雪飘过\n[01:50.028] 怀着冷却了的心窝漂远方\n[01:55.883] 风雨里追赶 雾里分不清影踪\n[02:02.166] 天空海阔你与我\n[02:05.219] 可会变 (谁没在变)\n[02:08.749] 原谅我这一生不羁放纵爱自由\n[02:15.720] 也会怕有一天会跌倒\n[02:21.978] 背弃了理想 谁人都可以\n[02:28.219] 哪会怕有一天只你共我\n[02:37.986] 仍然自由自我 永远高唱我歌\n[02:44.612] 走遍千里\n[02:49.228] 原谅我这一生不羁放纵爱自由\n[02:56.296] 也会怕有一天会跌倒\n[03:02.525] 背弃了理想 谁人都可以\n[03:08.780] 哪会怕有一天只你共我\n[03:14.224] 原谅我这一生不羁放纵爱自由\n[03:21.263] 也会怕有一天会跌倒\n[03:27.471] 背弃了理想 谁人都可以\n[03:33.720] 哪会怕有一天只你共我\n[03:40.096]\n"
}
const drumtower = {
  id: 447926067,
  name: "鼓楼",
  img: "https://p2.music.126.net/-noYXenVuiTrlcxrCqNPjQ==/109951169213362679.jpg",
  artists: [{ id: 35069014, name: "无法长大", tns: [], alias: [] }],
  duration: 281002,
  albumName: "无法长大",
  url: baseMusicUrl + 'gulou.mp3',
  artistsText: "赵雷",
  durationSecond:281.002,
  mvId: 0,
  lyric: "[00:00.000] 作词 : 赵雷\n[00:01.000] 作曲 : 赵雷\n[00:02.000] 编曲 : 赵雷/喜子\n[00:03.000] 制作人 : 赵雷/喜子/姜北生\n[00:04.000] 贝斯 : 张岭\n[00:05.000] 鼓 : 贝贝\n[00:06.000] 箱琴 : 赵雷\n[00:07.000] 口琴 : 赵雷\n[00:08.000] MIDI : 喜子\n[00:09.000] 和声 : 赵雷/孙嫣然/唐宁\n[00:25.600]我走在鼓楼下面 路在堵着\n[00:33.790]雨后的阳光散落 人们都出来了\n[00:41.320]\n[00:41.780]执着的迷惘的文艺青年很多\n[00:49.970]如果我无聊了就会来这里坐坐\n[00:56.800]\n[00:57.920]我是个沉默不语的靠着墙壁晒太阳的过客\n[01:06.070]如果我有些倦意了 就让我在这里独自醒过\n[01:15.260]我站在鼓楼上面 一切繁华与我无关\n[01:22.790]这是个拥挤的地方  而我却很平凡\n[01:31.980]\n[01:46.900]我走在鼓楼下面 淋湿的咖啡馆\n[01:54.960]睡不着的后海边 月亮还在抽着烟\n[02:03.150]喝醉的亲吻着 快活的人不眠\n[02:11.250]唯有我倚着围栏 对过往说晚安\n[02:19.100]\n[02:51.880]我是个沉默不语的靠着车窗想念你的乘客\n[02:59.890]当107路再次经过 时间是带走青春的电车\n[03:09.070]我站在什刹海边一切甜蜜与我无关\n[03:16.550]这是个拥挤的地方 而我却很孤单\n[03:24.250]我在鼓楼 我在鼓楼\n[03:32.270]我在鼓楼\n[03:40.270]我在鼓楼 我在鼓楼\n[03:48.340]我在鼓楼\n[04:36.002] 电琴：喜子\n"
}
const tianmasfantasy = {
  id: 26137712,
  name: "ペガサス幻想",
  img: "https://p2.music.126.net/6EvKvYPByiqq27MElimckw==/2438716790431640.jpg",
  artists: [{ id: 35069014, name: "MAKE-UP", tns: [], alias: [] }],
  duration: 229000,
  albumName: "聖闘士星矢",
  url: baseMusicUrl + 'huanxiang.mp3',
  artistsText: "圣斗士星矢Ω  原声带II",
  durationSecond:229.000,
  mvId: 0,
  lyric: "[00:35.750] 抱きしめた 心の小宇宙(コスモ)\n[00:41.880] 熱く燃やせ 奇跡を起こせ\n[00:47.310] 傷ついたままじゃいないと\n[00:53.450] 誓いあった 遥かな銀河\n[00:58.530]\n[01:00.500] ペガサス幻想(ファンタジー) そうさ夢だけは\n[01:05.80] 誰も奪えない 心の翼だから\n[01:11.190] 聖闘士 星矢 少年はみんな\n[01:16.930] 聖闘士 星矢 明日の勇者\n[01:22.750] 聖闘士 星矢 ペガサスのように\n[01:28.520] 聖闘士 星矢 今こそ はばたけ\n[01:36.350]\n[01:47.30] どこまでも 輝く空に\n[01:53.120] おまえだけの 星座をめざせ\n[01:58.640] その日まで 負けられないさ\n[02:04.770] 命賭けて 挑んだ バトル\n[02:09.669]\n[02:11.730] ペガサス幻想(ファンタジー) 誰もが夢見る\n[02:16.450] 自由という翼広げ 駆けてゆけ\n[02:22.500] 聖闘士 星矢 少年はみんな\n[02:28.200] 聖闘士 星矢 孤独な戦士\n[02:34.110] 聖闘士 星矢 ペガサスのように\n[02:39.880] 聖闘士 星矢 今こそ はばたけ\n[02:47.610]\n[03:02.690] ペガサス幻想(ファンタジー) そうさ夢だけは\n[03:07.410] 誰も奪えない 心の翼だから\n[03:16.350] 聖闘士 星矢 少年はみんな\n[03:22.120] 聖闘士 星矢 明日の勇者\n[03:27.980] 聖闘士 星矢 ペガサスのように\n[03:33.720] 聖闘士 星矢 今こそ はばたけ\n[03:41.550]\n[03:45.960]\n[03:47.329] ～END～\n"
}

const fushishanxia = {
  id: 26137712,
  name: "富士山下",
  img: "https://p2.music.126.net/jzNxBp5DCER2_aKGsXeRww==/109951167435823724.jpg",
  artists: [{ id: 35069014, name: "富士山下", tns: [], alias: [] }],
  duration: 258902,
  albumName: "富士山下",
  url: baseMusicUrl + 'fushishanxia.mp3',
  artistsText: "陈奕迅",
  durationSecond:258.902,
  mvId: 0,
  lyric: "[00:00.000] 作词 : 林夕\n[00:00.675] 作曲 : Christopher Chak\n[00:01.350] 编曲 : 陈珀/C. Y. Kong\n[00:02.025] 制作人 : 梁荣骏\n[00:02.700]\n[00:21.961]拦路雨偏似雪花 饮泣的你冻吗\n[00:26.464]这风褛我给你磨到有襟花\n[00:31.023]连调了职也不怕 怎么始终牵挂\n[00:35.618]苦心选中今天想车你回家\n[00:40.181]原谅我不再送花 伤口应要结疤\n[00:44.739]花瓣铺满心里坟场才害怕\n[00:49.337]如若你非我不嫁 彼此终必火化\n[00:53.878]一生一世等一天需要代价\n[00:58.438]谁都只得那双手靠拥抱亦难任你拥有\n[01:03.612]要拥有必先懂失去怎接受\n[01:08.177]曾沿着雪路浪游 为何为好事泪流\n[01:12.733]谁能凭爱意要富士山私有\n[01:17.292]何不把悲哀感觉假设是来自你虚构\n[01:21.912]试管里找不到它染污眼眸\n[01:26.405]前尘硬化像石头 随缘地抛下便逃走\n[01:34.143]我绝不罕有 往街里绕过一周\n[01:38.559]我便化乌有\n[01:42.640]情人节不要说穿 只敢抚你发端\n[01:47.193]这种姿态可会令你更心酸\n[01:51.795]留在汽车里取暖 应该怎么规劝\n[01:56.376]怎么可以将手腕忍痛划损\n[02:00.953]人活到几岁算短 失恋只有更短\n[02:05.501]归家需要几里路谁能预算\n[02:10.088]忘掉我跟你恩怨 樱花开了几转\n[02:14.697]东京之旅一早比一世遥远\n[02:19.226]谁都只得那双手靠拥抱亦难任你拥有\n[02:24.393]要拥有必先懂失去怎接受\n[02:28.941]曾沿着雪路浪游 为何为好事泪流\n[02:33.512]谁能凭爱意要富士山私有\n[02:38.087]何不把悲哀感觉假设是来自你虚构\n[02:42.681]试管里找不到它染污眼眸\n[02:47.210]前尘硬化像石头 随缘地抛下便逃走\n[02:54.214]我绝不罕有 往街里绕过一周\n[02:59.066]我便化乌有\n[03:03.313]谁都只得那双手靠拥抱亦难任你拥有\n[03:08.689]要拥有必先懂失去怎接受\n[03:13.391]曾沿着雪路浪游 为何为好事泪流\n[03:18.156]谁能凭爱意要富士山私有\n[03:22.849]何不把悲哀感觉假设是来自你虚构\n[03:27.562]试管里找不到它染污眼眸\n[03:32.248]前尘硬化像石头 随缘地抛下便逃走\n[03:41.286]我绝不罕有 往街里绕过一周\n[03:46.586]我便化乌有\n[03:52.009]你还嫌不够 我把这陈年风褛 送赠你解咒\n[04:01.002]\n[04:02.699]Produced by 梁荣骏\n[04:03.699]Production Coordination: Stanley Leung\n[04:04.699]Keyboards & Programming\n[04:05.699]Drums: Davy Chan (陈匡荣)\n[04:06.699]Bass: 细威\n[04:07.699]Guitar: Joey Tang (邓建明)\n[04:08.699]Percussion: Davy Chan & Kevin (Hardpack)\n[04:09.699]Strings Arranged & Conducted by 陈珀\n[04:10.699]Recorded at aroom studio & seewisehk,\n[04:11.699]Engineered by Davy Chan\n[04:12.699]Vocals Recorded at Avon Studios,\n[04:13.699]Engineered by Anthony Leung\n[04:14.699]Mixed by Simon Li at nOiz\n[04:15.699]OP: Forward Music Publishing Co Ltd\n[04:16.699]SP: Fujipacific Music (S.E. Asia) Ltd\n"
}
const xiaotiejiang = {
  id: 186057,
  name: " 米兰的小铁匠",
  img: "https://p1.music.126.net/eDfuSni9ZWToHdqilVRI_w==/109951166698447900.jpg",
  artists: [{ id: 35069014, name: "周杰伦", tns: [], alias: [] }],
  duration: 238654,
  albumName: "八度空间",
  url: baseMusicUrl + 'xiaotiejiang.mp3',
  artistsText: "周杰伦",
  durationSecond:238.654,
  mvId: 0,
  lyric:"[00:00.000] 作词 : 方文山\n[00:01.000] 作曲 : 周杰伦\n[00:02.000] 编曲 : 洪敬尧\n[00:03.000]\n[00:33.508]跑遍了牧场 又绕过了村庄\n[00:36.394]他就站在 街角的旧报摊\n[00:38.989]眼睛盯着 隔壁里的橱窗\n[00:41.577]一把吉他 远远欣赏\n[00:44.823]木炭 一箩筐\n[00:47.384]木炭 一直放\n[00:49.956]木炭 剩一半\n[00:51.750]火炉烫 小铁匠存钱买希望 在流汗\n[00:55.252]巴洛克建筑的街道旁\n[00:57.855]一家烟雾缭绕的酒馆\n[01:00.460]波兰的吟唱诗人在弹唱\n[01:02.500]小铁匠在门外\n[01:03.781]进不去在苦恼\n[01:05.089]他的铜板还太少\n[01:08.029]他真的真的想知道\n[01:10.604]那首来自东欧的民谣 和弦到底什么调\n[01:13.174]（米兰的天空刚破晓）\n[01:15.761]那马蹄铁还要敲多少 吉他才能买得到（他真的真的想知道）\n[01:20.603]他不知道怎么办才好 睡不着（他将那扑满打破了）\n[01:25.749]小小愿望就快实现了\n[01:29.660]他在笑\n[01:31.187]\n[01:40.624]跑遍了牧场 又绕过了村庄\n[01:43.493]他就站在 街角的旧报摊\n[01:46.032]眼睛盯着 隔壁里的橱窗\n[01:48.626]一把吉他 远远欣赏\n[01:51.895]木炭 一箩筐\n[01:54.493]木炭 一直放\n[01:57.048]木炭 剩一半\n[01:58.879]火炉烫 小铁匠存钱买希望 在流汗\n[02:02.439]巴洛克建筑的街道旁\n[02:04.992]一家烟雾缭绕的酒馆\n[02:07.565]波兰的吟唱诗人在弹唱\n[02:09.629]小铁匠在门外 进不去在苦恼\n[02:12.185]他的铜板还太少\n[02:15.245]他真的真的想知道\n[02:17.895]那首来自东欧的民谣 和弦到底什么调\n[02:20.490]（米兰的天空刚破晓）\n[02:23.089]那马蹄铁还要敲多少 吉他才能买得到（他真的真的想知道）\n[02:27.913]他不知道怎么办才好 睡不着（他将那扑满打破了）\n[02:33.112]小小愿望就快实现了\n[02:36.958]他在笑\n[02:38.922]\n[03:18.860]他真的真的想知道\n[03:21.476]那首来自东欧的民谣 和弦到底什么调\n[03:24.000]（米兰的天空刚破晓）\n[03:26.579]那马蹄铁还要敲多少 吉他才能买得到（他真的真的想知道）\n[03:31.443]他不知道怎么办才好 睡不着（他将那扑满打破了）\n[03:36.597]小小愿望就快实现了\n[03:40.454]他在笑\n[03:47.669]\n[03:50.000]合声编写：周杰伦\n[03:51.000]合声：周杰伦\n[03:52.000]录音工程：杨瑞代(J&A)、林迈可(AREA 51 Studio)\n[03:53.000]混音工程：杨大纬(丽风录音室)\n[03:54.000]混音助理：刘勇志\n[03:55.000]OP:Alfa Music International Co., Ltd.\n[03:56.000]ISRC-TW-C23-02-003-\n"
}

export { traillet, guest ,sky,drumtower,tianmasfantasy,fushishanxia,xiaotiejiang}




